cwmp/cwmpMessage/cwmp_USCOREagent.Inform.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:cwmp="urn:dslforum-org:cwmp-1-1">
 <SOAP-ENV:Header>
  <cwmp:HoldRequests SOAP-ENV:mustUnderstand=""></cwmp:HoldRequests>
  <cwmp:ID SOAP-ENV:mustUnderstand=""></cwmp:ID>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <cwmp:Inform>
    <DeviceId>
     <Manufacturer></Manufacturer>
     <OUI></OUI>
     <ProductClass></ProductClass>
     <SerialNumber></SerialNumber>
    </DeviceId>
    <Event SOAP-ENC:arrayType="cwmp:EventStruct[1]">
     <EventStruct>
      <EventCode></EventCode>
      <CommandKey></CommandKey>
     </EventStruct>
    </Event>
    <MaxEnvelopes>0</MaxEnvelopes>
    <CurrentTime></CurrentTime>
    <RetryCount>0</RetryCount>
    <ParameterList SOAP-ENC:arrayType="cwmp:ParameterValueStruct[1]">
     <ParameterValueStruct>
      <Name></Name>
      <Value></Value>
     </ParameterValueStruct>
    </ParameterList>
   </cwmp:Inform>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
